node {
  name: "x"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 224
        }
        dim {
          size: 224
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/rescaling_4/mul"
  op: "Mul"
  input: "x"
  input: "sequential_7/MobilenetV3large/rescaling_4/Cast/x"
}
node {
  name: "sequential_7/MobilenetV3large/rescaling_4/add"
  op: "AddV2"
  input: "sequential_7/MobilenetV3large/rescaling_4/mul"
  input: "sequential_7/MobilenetV3large/rescaling_4/Cast_1/x"
}
node {
  name: "sequential_7/MobilenetV3large/Conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/Conv/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/Conv/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/rescaling_4/add"
  input: "sequential_7/MobilenetV3large/Conv/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/Conv/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/Conv/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/Conv/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/Conv/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/Conv/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/Conv/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/Conv/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/Conv/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/Conv/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/Conv/Conv2D"
  input: "sequential_7/MobilenetV3large/Conv/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/Conv/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/Conv/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/Conv/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/tf.__operators__.add_82/AddV2"
  op: "AddV2"
  input: "sequential_7/MobilenetV3large/Conv/BatchNorm/FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/tf.__operators__.add_82/y"
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_103/Relu6"
  op: "Relu6"
  input: "sequential_7/MobilenetV3large/tf.__operators__.add_82/AddV2"
}
node {
  name: "sequential_7/MobilenetV3large/tf.math.multiply_82/Mul"
  op: "Mul"
  input: "sequential_7/MobilenetV3large/re_lu_103/Relu6"
  input: "sequential_7/MobilenetV3large/tf.math.multiply_82/Mul/y"
}
node {
  name: "sequential_7/MobilenetV3large/multiply_56/mul"
  op: "Mul"
  input: "sequential_7/MobilenetV3large/Conv/BatchNorm/FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/tf.math.multiply_82/Mul"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/depthwise/depthwise/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/depthwise/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "sequential_7/MobilenetV3large/multiply_56/mul"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/depthwise/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/depthwise"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_104/Relu"
  op: "Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/project/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/project/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/re_lu_104/Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv/Add/add"
  op: "AddV2"
  input: "sequential_7/MobilenetV3large/multiply_56/mul"
  input: "sequential_7/MobilenetV3large/expanded_conv/project/BatchNorm/FusedBatchNormV3"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/expand/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/expand/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv/Add/add"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_105/Relu"
  op: "Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/pad/Pad"
  op: "Pad"
  input: "sequential_7/MobilenetV3large/re_lu_105/Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/pad/Pad/paddings"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/depthwise/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/depthwise/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/pad/Pad"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/depthwise/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/depthwise"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_106/Relu"
  op: "Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/project/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/project/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/re_lu_106/Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/expand/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/expand/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_107/Relu"
  op: "Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/depthwise/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/depthwise/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "sequential_7/MobilenetV3large/re_lu_107/Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/depthwise/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/depthwise"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_108/Relu"
  op: "Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/project/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/project/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/re_lu_108/Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_2/Add/add"
  op: "AddV2"
  input: "sequential_7/MobilenetV3large/expanded_conv_1/project/BatchNorm/FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/project/BatchNorm/FusedBatchNormV3"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/expand/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/expand/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_2/Add/add"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_109/Relu"
  op: "Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/pad/Pad"
  op: "Pad"
  input: "sequential_7/MobilenetV3large/re_lu_109/Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/pad/Pad/paddings"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/depthwise/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/depthwise/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/pad/Pad"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/depthwise/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/depthwise"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_110/Relu"
  op: "Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/AvgPool/Mean"
  op: "Mean"
  input: "sequential_7/MobilenetV3large/re_lu_110/Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/AvgPool/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/AvgPool/Mean"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv/BiasAdd/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv/BiasAdd/ReadVariableOp"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Relu/Relu"
  op: "Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv/BiasAdd"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv_1/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv_1/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv_1/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Relu/Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv_1/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv_1/BiasAdd"
  op: "BiasAdd"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv_1/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp"
}
node {
  name: "sequential_7/MobilenetV3large/tf.__operators__.add_83/AddV2"
  op: "AddV2"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Conv_1/BiasAdd"
  input: "sequential_7/MobilenetV3large/tf.__operators__.add_83/y"
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_111/Relu6"
  op: "Relu6"
  input: "sequential_7/MobilenetV3large/tf.__operators__.add_83/AddV2"
}
node {
  name: "sequential_7/MobilenetV3large/tf.math.multiply_83/Mul"
  op: "Mul"
  input: "sequential_7/MobilenetV3large/re_lu_111/Relu6"
  input: "sequential_7/MobilenetV3large/tf.math.multiply_83/Mul/y"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Mul/mul"
  op: "Mul"
  input: "sequential_7/MobilenetV3large/re_lu_110/Relu"
  input: "sequential_7/MobilenetV3large/tf.math.multiply_83/Mul"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/project/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/project/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/squeeze_excite/Mul/mul"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/expand/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/expand/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_3/project/BatchNorm/FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_112/Relu"
  op: "Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/depthwise/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/depthwise/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "sequential_7/MobilenetV3large/re_lu_112/Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/depthwise/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/depthwise"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/ReadVariableOp_1"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_113/Relu"
  op: "Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/depthwise/BatchNorm/FusedBatchNormV3"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/AvgPool/Mean"
  op: "Mean"
  input: "sequential_7/MobilenetV3large/re_lu_113/Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/AvgPool/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/AvgPool/Mean"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv/BiasAdd/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv/BiasAdd/ReadVariableOp"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Relu/Relu"
  op: "Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv/BiasAdd"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv_1/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv_1/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv_1/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Relu/Relu"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv_1/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv_1/BiasAdd"
  op: "BiasAdd"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv_1/Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp"
}
node {
  name: "sequential_7/MobilenetV3large/tf.__operators__.add_84/AddV2"
  op: "AddV2"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Conv_1/BiasAdd"
  input: "sequential_7/MobilenetV3large/tf.__operators__.add_84/y"
}
node {
  name: "sequential_7/MobilenetV3large/re_lu_114/Relu6"
  op: "Relu6"
  input: "sequential_7/MobilenetV3large/tf.__operators__.add_84/AddV2"
}
node {
  name: "sequential_7/MobilenetV3large/tf.math.multiply_84/Mul"
  op: "Mul"
  input: "sequential_7/MobilenetV3large/re_lu_114/Relu6"
  input: "sequential_7/MobilenetV3large/tf.math.multiply_84/Mul/y"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Mul/mul"
  op: "Mul"
  input: "sequential_7/MobilenetV3large/re_lu_113/Relu"
  input: "sequential_7/MobilenetV3large/tf.math.multiply_84/Mul"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/project/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/project/Conv2D/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/project/Conv2D"
  op: "Conv2D"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/squeeze_excite/Mul/mul"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/project/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/project/BatchNorm/ReadVariableOp"
  op: "Identity"
  input: "sequential_7/MobilenetV3large/expanded_conv_4/project/BatchNorm/ReadVariableOp/resource"
}
node {
  name: "sequential_7/MobilenetV3large/expanded_conv_4/project/BatchNorm/ReadVariableOp_1"
  op: "Identity"
