node {
  name: "x"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 224
        }
        dim {
          size: 224
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "model_19/Conv1/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/Conv1/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/Conv1/Conv2D"
  op: "Conv2D"
  input: "x"
  input: "model_19/Conv1/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model_19/bn_Conv1/ReadVariableOp"
  op: "Identity"
  input: "model_19/bn_Conv1/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/bn_Conv1/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/bn_Conv1/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/bn_Conv1/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/bn_Conv1/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/bn_Conv1/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/bn_Conv1/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/bn_Conv1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/Conv1/Conv2D"
  input: "model_19/bn_Conv1/ReadVariableOp"
  input: "model_19/bn_Conv1/ReadVariableOp_1"
  input: "model_19/bn_Conv1/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/bn_Conv1/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/Conv1_relu/Relu6"
  op: "Relu6"
  input: "model_19/bn_Conv1/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_depthwise/depthwise/ReadVariableOp"
  op: "Identity"
  input: "model_19/expanded_conv_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model_19/Conv1_relu/Relu6"
  input: "model_19/expanded_conv_depthwise/depthwise/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model_19/expanded_conv_depthwise_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/expanded_conv_depthwise_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_depthwise_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/expanded_conv_depthwise_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/expanded_conv_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/expanded_conv_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/expanded_conv_depthwise/depthwise"
  input: "model_19/expanded_conv_depthwise_BN/ReadVariableOp"
  input: "model_19/expanded_conv_depthwise_BN/ReadVariableOp_1"
  input: "model_19/expanded_conv_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/expanded_conv_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/expanded_conv_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model_19/expanded_conv_depthwise_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_project/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/expanded_conv_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_project/Conv2D"
  op: "Conv2D"
  input: "model_19/expanded_conv_depthwise_relu/Relu6"
  input: "model_19/expanded_conv_project/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model_19/expanded_conv_project_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/expanded_conv_project_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_project_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/expanded_conv_project_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_project_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/expanded_conv_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_project_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/expanded_conv_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/expanded_conv_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/expanded_conv_project/Conv2D"
  input: "model_19/expanded_conv_project_BN/ReadVariableOp"
  input: "model_19/expanded_conv_project_BN/ReadVariableOp_1"
  input: "model_19/expanded_conv_project_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/expanded_conv_project_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_1_expand/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_1_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_expand/Conv2D"
  op: "Conv2D"
  input: "model_19/expanded_conv_project_BN/FusedBatchNormV3"
  input: "model_19/block_1_expand/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model_19/block_1_expand_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_1_expand_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_expand_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_1_expand_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_1_expand/Conv2D"
  input: "model_19/block_1_expand_BN/ReadVariableOp"
  input: "model_19/block_1_expand_BN/ReadVariableOp_1"
  input: "model_19/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_1_expand_relu/Relu6"
  op: "Relu6"
  input: "model_19/block_1_expand_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_pad/Pad"
  op: "Pad"
  input: "model_19/block_1_expand_relu/Relu6"
  input: "model_19/block_1_pad/Pad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model_19/block_1_depthwise/depthwise/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_1_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model_19/block_1_pad/Pad"
  input: "model_19/block_1_depthwise/depthwise/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "model_19/block_1_depthwise_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_1_depthwise_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_depthwise_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_1_depthwise_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_1_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_1_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_1_depthwise/depthwise"
  input: "model_19/block_1_depthwise_BN/ReadVariableOp"
  input: "model_19/block_1_depthwise_BN/ReadVariableOp_1"
  input: "model_19/block_1_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_1_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_1_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model_19/block_1_depthwise_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_project/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_1_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_project/Conv2D"
  op: "Conv2D"
  input: "model_19/block_1_depthwise_relu/Relu6"
  input: "model_19/block_1_project/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model_19/block_1_project_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_1_project_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_project_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_1_project_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_project_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_1_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_project_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_1_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_1_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_1_project/Conv2D"
  input: "model_19/block_1_project_BN/ReadVariableOp"
  input: "model_19/block_1_project_BN/ReadVariableOp_1"
  input: "model_19/block_1_project_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_1_project_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_2_expand/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_2_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_expand/Conv2D"
  op: "Conv2D"
  input: "model_19/block_1_project_BN/FusedBatchNormV3"
  input: "model_19/block_2_expand/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model_19/block_2_expand_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_2_expand_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_expand_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_2_expand_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_2_expand/Conv2D"
  input: "model_19/block_2_expand_BN/ReadVariableOp"
  input: "model_19/block_2_expand_BN/ReadVariableOp_1"
  input: "model_19/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_2_expand_relu/Relu6"
  op: "Relu6"
  input: "model_19/block_2_expand_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_depthwise/depthwise/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_2_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model_19/block_2_expand_relu/Relu6"
  input: "model_19/block_2_depthwise/depthwise/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model_19/block_2_depthwise_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_2_depthwise_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_depthwise_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_2_depthwise_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_2_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_2_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_2_depthwise/depthwise"
  input: "model_19/block_2_depthwise_BN/ReadVariableOp"
  input: "model_19/block_2_depthwise_BN/ReadVariableOp_1"
  input: "model_19/block_2_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_2_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_2_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model_19/block_2_depthwise_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_project/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_2_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_project/Conv2D"
  op: "Conv2D"
  input: "model_19/block_2_depthwise_relu/Relu6"
  input: "model_19/block_2_project/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model_19/block_2_project_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_2_project_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_project_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_2_project_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_project_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_2_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_project_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_2_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_2_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_2_project/Conv2D"
  input: "model_19/block_2_project_BN/ReadVariableOp"
  input: "model_19/block_2_project_BN/ReadVariableOp_1"
  input: "model_19/block_2_project_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_2_project_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_2_add/add"
  op: "AddV2"
  input: "model_19/block_1_project_BN/FusedBatchNormV3"
  input: "model_19/block_2_project_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_expand/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_3_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_expand/Conv2D"
  op: "Conv2D"
  input: "model_19/block_2_add/add"
  input: "model_19/block_3_expand/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model_19/block_3_expand_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_3_expand_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_expand_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_3_expand_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_expand_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_3_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_expand_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_3_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_3_expand/Conv2D"
  input: "model_19/block_3_expand_BN/ReadVariableOp"
  input: "model_19/block_3_expand_BN/ReadVariableOp_1"
  input: "model_19/block_3_expand_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_3_expand_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_3_expand_relu/Relu6"
  op: "Relu6"
  input: "model_19/block_3_expand_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_pad/Pad"
  op: "Pad"
  input: "model_19/block_3_expand_relu/Relu6"
  input: "model_19/block_3_pad/Pad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model_19/block_3_depthwise/depthwise/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_3_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model_19/block_3_pad/Pad"
  input: "model_19/block_3_depthwise/depthwise/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "model_19/block_3_depthwise_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_3_depthwise_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_depthwise_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_3_depthwise_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_3_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_3_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_3_depthwise/depthwise"
  input: "model_19/block_3_depthwise_BN/ReadVariableOp"
  input: "model_19/block_3_depthwise_BN/ReadVariableOp_1"
  input: "model_19/block_3_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_3_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_3_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model_19/block_3_depthwise_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_project/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_3_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_project/Conv2D"
  op: "Conv2D"
  input: "model_19/block_3_depthwise_relu/Relu6"
  input: "model_19/block_3_project/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model_19/block_3_project_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_3_project_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_project_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_3_project_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_project_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_3_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_project_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_3_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_3_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_3_project/Conv2D"
  input: "model_19/block_3_project_BN/ReadVariableOp"
  input: "model_19/block_3_project_BN/ReadVariableOp_1"
  input: "model_19/block_3_project_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_3_project_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_4_expand/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_4_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_expand/Conv2D"
  op: "Conv2D"
  input: "model_19/block_3_project_BN/FusedBatchNormV3"
  input: "model_19/block_4_expand/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model_19/block_4_expand_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_4_expand_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_expand_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_4_expand_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_4_expand/Conv2D"
  input: "model_19/block_4_expand_BN/ReadVariableOp"
  input: "model_19/block_4_expand_BN/ReadVariableOp_1"
  input: "model_19/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_4_expand_relu/Relu6"
  op: "Relu6"
  input: "model_19/block_4_expand_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_depthwise/depthwise/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_4_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model_19/block_4_expand_relu/Relu6"
  input: "model_19/block_4_depthwise/depthwise/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model_19/block_4_depthwise_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_4_depthwise_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_depthwise_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_4_depthwise_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_4_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_4_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_4_depthwise/depthwise"
  input: "model_19/block_4_depthwise_BN/ReadVariableOp"
  input: "model_19/block_4_depthwise_BN/ReadVariableOp_1"
  input: "model_19/block_4_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_4_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_4_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model_19/block_4_depthwise_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_project/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_4_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_project/Conv2D"
  op: "Conv2D"
  input: "model_19/block_4_depthwise_relu/Relu6"
  input: "model_19/block_4_project/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model_19/block_4_project_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_4_project_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_project_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_4_project_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_project_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_4_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_project_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_4_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_4_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_4_project/Conv2D"
  input: "model_19/block_4_project_BN/ReadVariableOp"
  input: "model_19/block_4_project_BN/ReadVariableOp_1"
  input: "model_19/block_4_project_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_4_project_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_4_add/add"
  op: "AddV2"
  input: "model_19/block_3_project_BN/FusedBatchNormV3"
  input: "model_19/block_4_project_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_expand/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_5_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_expand/Conv2D"
  op: "Conv2D"
  input: "model_19/block_4_add/add"
  input: "model_19/block_5_expand/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model_19/block_5_expand_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_5_expand_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_expand_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_5_expand_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_expand_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_5_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_expand_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_5_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_5_expand/Conv2D"
  input: "model_19/block_5_expand_BN/ReadVariableOp"
  input: "model_19/block_5_expand_BN/ReadVariableOp_1"
  input: "model_19/block_5_expand_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_5_expand_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_5_expand_relu/Relu6"
  op: "Relu6"
  input: "model_19/block_5_expand_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_depthwise/depthwise/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_5_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model_19/block_5_expand_relu/Relu6"
  input: "model_19/block_5_depthwise/depthwise/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model_19/block_5_depthwise_BN/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_5_depthwise_BN/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_depthwise_BN/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_5_depthwise_BN/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_5_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "model_19/block_5_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model_19/block_5_depthwise/depthwise"
  input: "model_19/block_5_depthwise_BN/ReadVariableOp"
  input: "model_19/block_5_depthwise_BN/ReadVariableOp_1"
  input: "model_19/block_5_depthwise_BN/FusedBatchNormV3/ReadVariableOp"
  input: "model_19/block_5_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "model_19/block_5_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model_19/block_5_depthwise_BN/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_project/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "model_19/block_5_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model_19/block_5_project/Conv2D"
  op: "Conv2D"
  input: "model_19/block_5_depthwise_relu/Relu6"
  input: "model_19/block_5_project/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
